INSERT INTO 
    task_condition_relations (`id`, `task_id`, `condition_id`, `author_id`,`group_id`)
VALUES 
    -- グレコラテン方格 
    -- ホテル1 x 観点4パターン
    (1, 1, 1, 1, 1),
    (2, 2, 2, 1, 1),
    (3, 3, 3, 1, 1),
    (4, 4, 4, 1, 1),
    -- ホテル2 x 観点4パターン
    (5, 2, 4, 1, 2),
    (6, 1, 3, 1, 2),
    (7, 4, 2, 1, 2),
    (8, 3, 1, 1, 2),
    -- ホテル3 x 観点4パターン
    (9,  3, 2, 1, 3),
    (10, 4, 1, 1, 3),
    (11, 1, 4, 1, 3),
    (12, 2, 3, 1, 3),
    -- ホテル4 x 観点4パターン
    (13, 4, 3, 1, 4),
    (14, 3, 4, 1, 4),
    (15, 2, 1, 1, 4),
    (16, 1, 2, 1, 4);

